Autodesk.Revit.UI.TaskDialogCommonButtons
A enumerated type containing the standard buttons available for Task Dialogs.
Since: 2011

Autodesk.Revit.UI.TaskDialogCommonButtons.Close
Close button.

Autodesk.Revit.UI.TaskDialogCommonButtons.Retry
Retry button.

Autodesk.Revit.UI.TaskDialogCommonButtons.Cancel
Cancel button.

Autodesk.Revit.UI.TaskDialogCommonButtons.No
No button.

Autodesk.Revit.UI.TaskDialogCommonButtons.Yes
Yes button.

Autodesk.Revit.UI.TaskDialogCommonButtons.Ok
OK button.

Autodesk.Revit.UI.TaskDialogCommonButtons.None
No common button.